#******************************************************************************#
# Makefile                                                                     #
#                                                                   2018/10/05 #
# Copyright (C) 2018 Mochi.                                                    #
#******************************************************************************#
#******************************************************************************#
#* 定義                                                                       *#
#******************************************************************************#
# プログラム名
PROG = mtty

# ソースコード
SRCS = main.c

# ソースコードディレクトリ
SRC_DIR = src

# オブジェクトファイル生成先
OBJ_DIR = obj

# Cフラグ
CFLAGS = -I../../kernel/src/include \
         -I../mterm/src             \
         -ffreestanding             \
         -nostdlib                  \
         -m32                       \
         -fno-pic                   \
         -static                    \
         -masm=intel

# LDフラグ
LDFLAGS = -Tmtty.lds                          \
          -melf_i386                          \
          -L../../kernel/build/objs/libraries

# ライブラリ
LIBS = -lc  \
       -lMk


#******************************************************************************#
# マクロ                                                                      *#
#******************************************************************************#
# オブジェクトサブディレクトリ
OBJ_SUBDIRS = $(sort $(addprefix $(OBJ_DIR)/, $(dir $(SRCS))))

# オブジェクトファイル
OBJS = $(addprefix $(OBJ_DIR)/, $(SRCS:.c=.o))

# 依存関係ファイル
DEPS = $(addprefix $(OBJ_DIR)/, $(SRCS:.c=.d))


#******************************************************************************#
#* phonyターゲット                                                            *#
#******************************************************************************#
.PHONY: all
all: $(OBJ_SUBDIRS) $(OBJS) $(OBJ_DIR)/$(PROG) Makefile

.PHONY: clean
clean:
	-rm -rf $(OBJ_DIR)


#******************************************************************************#
#* 生成規則                                                                   *#
#******************************************************************************#
-include $(DEPS)

ifdef OBJ_SUBDIRS
$(OBJ_SUBDIRS):
	mkdir -p $@
endif

$(OBJ_DIR)/$(PROG): $(OBJS) Makefile
	$(LD) $(LDFLAGS) -o $@ $(OBJS) $(LIBS)

$(OBJ_DIR)/%.o: $(SRC_DIR)/%.c Makefile
	$(CC) $(CFLAGS) -o $@ -c $< -MD -MP


#******************************************************************************#
