/******************************************************************************/
/*                                                                            */
/* src/mtty/Bufmng.h                                                          */
/*                                                                 2020/08/11 */
/* Copyright (C) 2020 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
#ifndef BUFMNG_H
#define BUFMNG_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdbool.h>
#include <stddef.h>

/* 共通ヘッダ */
#include "mtty.h"


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/* バッファ管理初期化 */
extern void BufmngInit( void );
/* 読込み用バッファ取出し */
extern size_t BufmngPopForRead( MttyDevID_t id,
                                void        *pData,
                                size_t      size    );
/* 読込み用バッファ追加 */
extern size_t BufmngPushForRead( MttyDevID_t id,
                                 void        *pData,
                                 size_t      size    );


/******************************************************************************/
#endif
