/******************************************************************************/
/*                                                                            */
/* src/mtty/config.h                                                          */
/*                                                                 2020/08/11 */
/* Copyright (C) 2020 mochi.                                                  */
/*                                                                            */
/******************************************************************************/
#ifndef CONFIG_H
#define CONFIG_H
/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/* 読込みバッファサイズ */
#define CONFIG_BUFSIZE_R_SERIAL1 ( 4096 )   /**< serial1読込バッファサイズ */
#define CONFIG_BUFSIZE_R_SERIAL2 ( 4096 )   /**< serial2読込バッファサイズ */

/* デバイスファイル読書きサイズ */
#define CONFIG_SIZE_READ ( 512 )    /**< デバイスファイル読込みサイズ */

/** ユーザイベントスレッド用スタックサイズ */
#define CONFIG_SIZE_STACK ( 8192 )


/******************************************************************************/
#endif
