/******************************************************************************/
/*                                                                            */
/* src/mtty/Sess.h                                                            */
/*                                                                 2020/05/04 */
/* Copyright (C) 2020 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
#ifndef SESS_H
#define SESS_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdint.h>
#include <kernel/types.h>

/* 共通ヘッダ */
#include "mtty.h"


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/* FD->デバイスID変換 */
extern MttyDevId_t SessConvertFdToId( uint32_t globalFd );
/* セッション切断 */
extern void SessDoVfsClose( uint32_t globalFd );
/* セッション接続 */
extern void SessDoVfsOpen( MkPid_t    pid,
                           uint32_t   globalFd,
                           const char *pPath    );
/* セッション管理初期化 */
extern void SessInit( void );


/******************************************************************************/
#endif
