/******************************************************************************/
/*                                                                            */
/* src/mtty/Sessmng.h                                                         */
/*                                                                 2020/08/11 */
/* Copyright (C) 2020 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
#ifndef SESSMNG_H
#define SESSMNG_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stdint.h>
#include <kernel/types.h>

/* 共通ヘッダ */
#include "mtty.h"


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/* FD->デバイスID変換 */
extern MttyDevID_t SessmngConvertToDevID( uint32_t globalFD );
/* セッション切断 */
extern void SessmngDoVfsClose( uint32_t globalFD );
/* セッション接続 */
extern void SessmngDoVfsOpen( MkPid_t    pid,
                              uint32_t   globalFD,
                              const char *pPath    );
/* セッション管理初期化 */
extern void SessmngInit( void );


/******************************************************************************/
#endif
