/******************************************************************************/
/*                                                                            */
/* src/mtty/Tctrl.h                                                           */
/*                                                                 2020/08/11 */
/* Copyright (C) 2020 Mochi.                                                  */
/*                                                                            */
/******************************************************************************/
#ifndef TCTRL_H
#define TCTRL_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 標準ヘッダ */
#include <stddef.h>
#include <stdint.h>

/* 共通ヘッダ */
#include "mtty.h"


/******************************************************************************/
/* グローバル関数宣言                                                         */
/******************************************************************************/
/* ターミナルファイル読込み */
extern void TctrlDoVfsRead( uint32_t globalFD,
                            uint64_t readIdx,
                            size_t   size      );
/* ターミナルファイル書込み */
extern void TctrlDoVfsWrite( uint32_t globlaFD,
                             uint64_t writeIdx,
                             void     *pBuffer,
                             size_t   size      );
/* ターミナル制御初期化 */
extern void TctrlInit( void );
/* 読込みレディ */
extern void TctrlReadyRead( MttyDevID_t id );


/******************************************************************************/
#endif
