/******************************************************************************/
/* src/ldisc.c                                                                */
/*                                                                 2018/10/10 */
/* Copyright (C) 2018 Mochi.                                                  */
/******************************************************************************/
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 共通ヘッダ */
#include <stdbool.h>
#include <stddef.h>
#include <kernel/library.h>
#include <mterm.h>

/* モジュールヘッダ */


/******************************************************************************/
/* ローカル関数宣言                                                           */
/******************************************************************************/
/* エコー */
static void Echo( char code );

/* BSエコー */
static void EchoBS( char code );

/* バッファ送信 */
static void SendBuffer( void );


/******************************************************************************/
/* グローバル変数宣言                                                         */
/******************************************************************************/
/* 行バッファ */
static char gBuffer[ 4096 ];

/* 行バッファ長 */
static size_t gBufferLen = 0;

/* [仮]readフラグ */
static bool gRead = false;


/******************************************************************************/
/* グローバル関数定義                                                         */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       端末データ読込実行
 * @detail      ユーザプログラムからのread要求を受け付ける。
 */
/******************************************************************************/
void LdiscDoRead( void )
{
    /* [仮]readフラグ設定 */
    gRead = true;
    
    return;
}


/******************************************************************************/
/**
 * @brief       コード入力
 * @detail      ターミナルエミュレータからの入力コードを処理する。
 * 
 * @param[in]   *pCode コード
 * @param[in]   size   コードサイズ
 */
/******************************************************************************/
void LdiscInput( char   *pCode,
                 size_t size    )
{
    uint32_t index;
    
    for ( index = 0; index < size; index++ ) {
        /* コード判定 */
        if ( pCode[ index ] == '\n' ) {
            /* 改行 */
            
            /* エコー */
            Echo( '\n' );
            
            /* 行バッファ送信 */
            SendBuffer();
            
        } else if ( pCode[ index ] == '\b' ) {
            /* バックスペース */
            
            /* バッファサイズ判定 */
            if ( gBufferLen != 0 ) {
                /* 1以上 */
                
                /* バッファ一文字削除 */
                gBufferLen--;
                
                /* エコー */
                EchoBS( gBuffer[ gBufferLen ] );
            }
            
        } else {
            /* その他 */
            
            /* バッファ書込み */
            gBuffer[ gBufferLen++ ] = pCode[ index ];
            
            /* エコー */
            Echo( pCode[ index ] );
        }
    }
    
    return;
}


/******************************************************************************/
/* ローカル関数定義                                                           */
/******************************************************************************/
/******************************************************************************/
/**
 * @brief       エコー
 * @detail      ASCIIコードをエコーする。一部を除いた制御コードはキャレット記法
 *              に変換してエコーする。
 * 
 * @param[in]   code コード
 */
/******************************************************************************/
static void Echo( char code )
{
    char             buffer[ sizeof ( MtermMsgOutput_t ) + 2 ];
    uint8_t          length;
    MtermMsgOutput_t *pMsg;
    
    /* 初期化 */
    length = 0;
    pMsg   = ( MtermMsgOutput_t * ) buffer;
    
    /* 文字コード判定 */
    if ( ( code == '\n' ) ||
         ( code == '\t' ) ||
         ( code == '\b' )    ) {
        /* 改行、水平タブ、または、バックスペース */
        
        /* 設定 */
        pMsg->data[ length++ ] = code;
        
    } else if ( ( ( 0 <= code ) && ( code <= 0x1F ) ) ||
                ( code == 0x7F                      )    ) {
        /* 制御コード */
        
        /* 文字コード変換設定 */
        pMsg->data[ length++ ] = '^';
        pMsg->data[ length++ ] = code + '@';
        
    } else {
        /* その他 */
        
        /* 設定 */
        pMsg->data[ length++ ] = code;
    }
    
    
    /* メッセージ設定 */
    pMsg->header.funcId = MTERM_FUNC_OUTPUT;
    pMsg->header.length = length;
    
    /* 出力 */
    MkMsgSend( 3, pMsg, sizeof ( MtermMsgHdr_t ) + length, NULL );
    
    return;
}


/******************************************************************************/
/**
 * @brief       BSエコー
 * @detail      指定したコードの文字数に合わせて、バックスペースをエコーする。
 *              指定したコードがキャレット記法により2文字で表現される場合は、2
 *              文字分のバックスペースをエコーする。
 * 
 * @param[in]   code コード
 */
/******************************************************************************/
static void EchoBS( char code )
{
    char             buffer[ sizeof ( MtermMsgOutput_t ) + 2 ];
    uint8_t          length;
    MtermMsgOutput_t *pMsg;
    
    /* 初期化 */
    length = 0;
    pMsg   = ( MtermMsgOutput_t * ) buffer;
    
    /* 文字コード判定 */
    if ( ( code == '\n' ) ||
         ( code == '\t' ) ||
         ( code == '\b' )    ) {
        /* 改行、水平タブ、または、バックスペース */
        
        /* 設定 */
        pMsg->data[ length++ ] = '\b';
        
    } else if ( ( ( 0 <= code ) && ( code <= 0x1F ) ) ||
                ( code == 0x7F                      )    ) {
        /* 制御コード */
        
        /* 文字コード変換設定 */
        pMsg->data[ length++ ] = '\b';
        pMsg->data[ length++ ] = '\b';
        
    } else {
        /* その他 */
        
        /* 設定 */
        pMsg->data[ length++ ] = '\b';
    }
    
    
    /* メッセージ設定 */
    pMsg->header.funcId = MTERM_FUNC_OUTPUT;
    pMsg->header.length = length;
    
    /* 出力 */
    MkMsgSend( 3, pMsg, sizeof ( MtermMsgHdr_t ) + length, NULL );
    
    return;
}


/******************************************************************************/
/**
 * @brief       バッファ送信
 * @detail      バッファを送信する。
 */
/******************************************************************************/
static void SendBuffer( void )
{
    /* [仮]readチェック */
    if ( gRead == true ) {
        /* read有り */
        
        /* バッファ送信 */
        MkMsgSend( 5, gBuffer, gBufferLen, NULL );
        
        /* 初期化 */
        gBufferLen = 0;
        gRead      = false;
    }
    
    return;
}


/******************************************************************************/
