/******************************************************************************/
/* src/mtty.h                                                                 */
/*                                                                 2018/10/10 */
/* Copyright (C) 2018 Mochi.                                                  */
/******************************************************************************/
#ifndef MTTY_H
#define MTTY_H
/******************************************************************************/
/* インクルード                                                               */
/******************************************************************************/
/* 共通ヘッダ */
#include <stddef.h>
#include <stdint.h>


/******************************************************************************/
/* 定義                                                                       */
/******************************************************************************/
/* 機能ID */
#define MTTY_FUNC_INPUT  ( 0x00000001 ) /* 端末データ入力 */
#define MTTY_FUNC_READ   ( 0x00000002 ) /* 端末データ読込 */
#define MTTY_FUNC_WRITE  ( 0x00000003 ) /* 端末データ書込 */

/** メッセージヘッダ */
typedef struct {
    uint32_t funcId;        /**< 機能ID   */
    size_t   length;        /**< データ長 */
} MttyMsgHdr_t;

/** 入出力メッセージ */
typedef struct {
    MttyMsgHdr_t header;    /**< ヘッダ */
    char         data[];    /**< データ */
} MttyMsgInput_t;

/** 端末データ読込メッセージ */
typedef struct {
    MttyMsgHdr_t header;    /**< ヘッダ */
} MttyMsgRead_t;

/** 端末データ書込メッセージ */
typedef struct {
    MttyMsgHdr_t header;    /**< ヘッダ */
    char         data[];    /**< データ */
} MttyMsgWrite_t;


/******************************************************************************/
#endif
